; ===========================================================================
;  FM77AV  SwapIPL(FM-NEW7のNewBOOT ROMに差し替えることが目的)
; ===========================================================================

; ---------------------------------------------------------------------------
; BIOSエントリ
; ---------------------------------------------------------------------------
BOOT_ENTRY      equ     $FE00                   ; ブートエントリー
DISK_RESTORE    equ     $FE02                   ; シークトラック0 (未使用)
DISK_WRITE      equ     $FE05                   ; セクタライト (未使用)
DISK_READ       equ     $FE08                   ; セクタリード

; ---------------------------------------------------------------------------
; I/Oエントリ
; ---------------------------------------------------------------------------
BOOT_SEL_STAT   equ     $FD0B                   ; ブート選択スイッチステータス
                                                ;   bit0: 0=BASIC / 1=DOS
MODE_SEL_REG1   equ     $FD93                   ; モードセレクトレジスタ1
                                                ;   bit0: ブートRAM
                                                ;     0=書込禁止 / 1=書込許可
MOVE_IPL        equ     $6000                   ; IPL移動先
BODY_DST        equ     $6200                   ; 追加セクタ読込先

; ===========================================================================
                org     $0000                   ; ロード先アドレス($0100/$0300)に
                                                ; よらない相対配置で書く
START
; ---------------------------------------------------------------------------
; 1. 自分自身を$6000へコピー
; ---------------------------------------------------------------------------
do_copy
                clrb                            ; 256バイト転送
                leax    START,pcr               ; X = 自分の実ロードアドレス($100か$300)
                ldy     #MOVE_IPL               ; 転送先
copy_loop
                lda     ,x+
                sta     ,y+
                decb
                bne     copy_loop

; ---------------------------------------------------------------------------
; 2. 処理を$6000に移動
; ---------------------------------------------------------------------------
                jmp     MOVE_IPL+common
common
; ---------------------------------------------------------------------------
; 3. ブート選択スイッチよりモードを判定
; ---------------------------------------------------------------------------
                pshs    dp
                lda     #$FD
                tfr     a,dp
                ldb     <BOOT_SEL_STAT
                andb    #%00000001
; ---------------------------------------------------------------------------
; 4a. BASICモード: track0 sector4,5を$6200へ読み込む
; 4b. DOSモード  : track0 sector6,7を$6200へ読み込む
; ---------------------------------------------------------------------------
                pshs    b                       ; スイッチ状態をスタックに退避
                lslb                            ; 2倍する
                addb    #4                      ; 4に加算 ∴セクタ4か6になる
                stb     RCBSCT+MOVE_IPL         ; 読み込みセクタ
                ldx     #RCB_DREAD+MOVE_IPL     ; XレジスタにRCBを指定する
                jsr     DISK_READ               ; FDから読み込み

                inc     RCBSCT+MOVE_IPL         ; 次のセクタ
                inc     RCBDBA+MOVE_IPL         ; バッファの上位を+1(256バイト先に)する
                ldx     #RCB_DREAD+MOVE_IPL     ; XレジスタにRCBを指定する
                jsr     DISK_READ               ; FDから読み込み
; ---------------------------------------------------------------------------
; 5. $FE00-$FFFFを書込み可能 → $6200-$63FFの内容をコピー → 書込み禁止
; ---------------------------------------------------------------------------
                lda     <MODE_SEL_REG1
                ora     #%00000001
                sta     <MODE_SEL_REG1          ; ブートRAMを書込可

                ldy     #BODY_DST
                ldx     #BOOT_ENTRY
bios_copy
                lda     ,y+
                sta     ,x+
                leax    ,x                      ; Xレジスタを読んでZフラグ更新
                bne     bios_copy               ; Xレジスタが(アドレス)$0000になるまで

                lda     <MODE_SEL_REG1
                anda    #%11111110
                sta     <MODE_SEL_REG1          ; ブートRAMを書込禁止
; ---------------------------------------------------------------------------
; 6. track0 sector8(,9)に保存したDISKのIPLを読み込み、
;    モードに応じたアドレスに展開して実行
; ---------------------------------------------------------------------------
                lda     #8
                sta     RCBSCT+MOVE_IPL         ; セクタ8指定
                puls    b                       ; モードスイッチ選択状態
                cmpb    #%00000001
                beq     dos_mode

basic_mode
                ldx     #$0100
                stx     RCBDBA+MOVE_IPL         ; 読み込み先 $0100
                ldx     #RCB_DREAD+MOVE_IPL     ; XレジスタにRCBを指定する
                jsr     DISK_READ
                puls    dp
                jmp     $0100

dos_mode
                ldx     #$0300
                stx     RCBDBA+MOVE_IPL         ; 読み込み先 $0300
                ldx     #RCB_DREAD+MOVE_IPL     ; XレジスタにRCBを指定する
                jsr     DISK_READ

                inc     RCBSCT+MOVE_IPL         ; 次のセクタにする
                inc     RCBDBA+MOVE_IPL         ; バッファの上位を+1(256バイト先)にする
                ldx     #RCB_DREAD+MOVE_IPL     ; XレジスタにRCBを指定する
                jsr     DISK_READ
                puls    dp
                jmp     $0300
; ---------------------------------------------------------------------------
; RCB(DREAD)エントリー
; ---------------------------------------------------------------------------
RCB_DREAD       equ     *
RQNO            fcb     10                      ; リクエスト番号(DREAD)
RCBSTA          fcb     0                       ; エラーステータス
RCBDBA          fdb     BODY_DST                ; データバッファ先頭アドレス
RCBTRK          fcb     0                       ; トラック番号(C)
RCBSCT          fcb     4                       ; セクタ番号(R)
RCBSID          fcb     0                       ; サイド番号(H)
RCBUNT          fcb     0                       ; ドライブ番号

                end     START
